let words = ['вОвремя','давнИшний','докраснА','зАнятый','зимОвщик','импЕрский','исключИт','начАв','убрАть','обострИть','опОшлят','процЕнт','срЕдствами','щАвель','баловАть','вЕрба','включЕн','включИм','влилАсь','балОванный',' балОванный',' балУясь',' включЕн',' включЕнный',' включЕнный',' довезЕнный',' зАгнутый',' зАнятый',' зАпертый',' зАтемно',' закУпорив',' занятА',' запертА',' заселЕнный',' заселенА',' защемИт',' избалОванный',' кормЯщий',' красИвее',' кровоточАщий',' молЯщий',' нАжитый',' нАчатый',' навЕрх',' надОлго',' нажИвший',' нажитА',' налИвший',' налитА',' нанЯвшийся',' начАв',' начАвший',' начАвшись',' начатА',' ненадОлго',' низведЕн',' низведЕнный',' низведЕнный',' ободрЕн',' ободрЕнный',' ободренА',' обострЕнный',' определЕн',' определЕнный',' отдАв',' отключЕнный',' повторЕнный',' поделЕнный',' поднЯв',' понЯв',' понЯвший',' понялА',' послАла',' послАть',' прИбыл',' прИбыло',' прИнял',' прИняли',' прИнятый',' прибЫв',' прибЫть',' прибылА',' принялА',' приручЕнный',' прожИвший',' рвалА',' рвАть',' сОгнутый',' сверлИт',' сверлИть',' сверлИшь',' снЯтый',' снЯть',' снялА',' снятА',' создАть',' создалА',' сорИт',' сорИть',' сорвАть',' сорвалА',' убрАть',' убралА',' убыстрИть',' углубИть',' укрепИт',' укрепИть',' чЕрпать',' щЕлкать',' щемИт',' щемИть','Иксы','Отзыв(на публикацию)','Отрочество','алфавИт','аэропОрты','бАнты','бАнты','бОроду','болтлИва','брАться','бралА','бралАсь','бухгАлтеров','вОвремя','вернА','вероисповЕдание','взЯться','взялА','взялАсь','влИться','влилАсь','водопровОд','ворвАться','ворвалАсь','воспринЯть','воспринялА','воссоздалА','вручИт','вручИть','газопровОд','гнАться','гналА','гналАсь','граждАнство','дОверху','дОнизу','дОсуха','дефИс','децимЕтр','дешевИзна','диалОг','диспансЕр','доЯр','добелА','добрАть','добрАться','добралА','добралАсь','договорЕнность','дождАться','дождалАсь','дозИровать','дозвонИтся','дозвонИться','дозвонЯтся','докумЕнт','донЕльзя','досУг','еретИк','жИться','жалюзИ','ждалА','жилОсь','зАгодя','зАнял','зАняли','зАняло','зАсветло','завИдно','закУпорить','занЯть','занялА','заперЕть','заперЕться','заперлА','заперлАсь','звалА','звонИм','звонИт','звонИть','звонИшь','знАчимость','знАчимый','знАчимый','исповЕдать','исчЕрпать','кОнусов','кОнусы','кУхонный','каталОг','каталОг','квартАл','киломЕтр','киоскЕр','клАла','клАсть','клЕить','контролЕр','корЫсть','крАлась','крАны','крАсться','красИвее','красИвейший','кремЕнь','кремнЯ','лЕкторов','лЕкторы','лИться','лгалА','лилА','лилАсь','ловкА','лыжнЯ','мЕстностей','мЕстностей','малЯр','миллимЕтр','мозаИчный','монолОг','мусоропровОд','нАчал','нАчали','нЕдруг','нЕнависть','нОвости','нОготь','нОгтя','наврАть','навралА','наделИт','наделИть','надорвАться','надорвалАсь','назвАться','назвалАсь','накренИтся','накренИться','налИть','налилА','намЕрение','нарОст','нарвАть','нарвалА','насорИт','насорИть','начАть','началА','недУг','некролОг','некролОг','нефтепровОд','новостЕй','новостЕй','нормировАть','обзвонИт','обзвонИть','облИться','облегчИт','облегчИть','облилАсь','обнЯться','обнялАсь','обогнАть','обогналА','ободрАть','ободрИть','ободрИться','ободрИшься','ободралА','обострИть','огОнь','одолжИт','одолжИть','озлОбить','оклЕить','окружИт','окружИть','опОшлить','опломбировАть','оптОвый','освЕдомиться','освЕдомишься','отбЫть','отбылА','отдАть','отдалА','отзЫв(посла)','откУпорил','откУпорить','отозвАть','отозвАться','отозвалА','отозвалАсь','пОручни','пОчестей','партЕр','перезвонИт','перезвонИть','перелИть','перелилА','плодоносИть','повторИт','повторИть','позЫв','позвАть','позвалА','позвонИт','позвонИть','позвонИшь','полИть','полилА','положИл','положИть','понЯть','портфЕль','премировАть','придАное','призЫв','призЫв','принУдить','принЯть','прожОрлива','прозорлИва','сантимЕтр','свЕкла','сирОты','слИва','слИвовый','смазлИва','созЫв','созЫв','создАв','сортировАть','срЕдства','стАтуя','столЯр','суетлИва','тОртов','тОрты','тамОжня','формировАть','цЕнтнер','цемЕнт','цепОчка','чЕлюстей','шАрфы','школЯр','шофЕр','экспЕрт']
let j = 1
let t = document.querySelector('.true')
let m = document.querySelector('.msg')
let q = document.querySelector('.quest')
let a = document.querySelector('.answer-block')
function check(is = false) {
	a.style['display'] = 'block'
	q.style['display'] = 'none'
	if (is) {
		m.innerHTML = 'Правильно!'
		t.style.color = '#2EE036'
	}
	else {
		m.innerHTML = 'Ошибка!'
		t.style.color = '#D91414'
	}
}
function generate(i = Math.floor(Math.random() * words.length)) {
	while (i == j)
		i = Math.floor(Math.random() * words.length)
	q.innerHTML = convert(words[i])
	t.innerHTML = words[i]
	a.style['display'] = 'none'
	q.style['display'] = 'block'
	j = i
	return words[i]
}
function convert(s) {
	let smallVowels = ['у','е','ы','а','о','э','я','и','ю','ё']
	let bigVowels = ['У','Е','Ы','А','О','Э','Я','И','Ю','Ё']
	let st = ''
	for (let i=0;i<s.length;i++){
		if (smallVowels.indexOf(s[i])!=-1) st +=`<span class="vowel" onclick="check()">${s[i]}</span>`
		else if (bigVowels.indexOf(s[i])!=-1) st += `<span class="vowel" onclick="check(true)">${s[i].toLowerCase()}</span>`
		else if (s[i] == '('){
			st += s.slice(i,s.length)
			break
		} else st += s[i]
	}
	return st
}
generate()